# Lab session 8 - Jupyter Notebook

This is a redesign version for lab session 5. I will be using the same data , but will be integrating them together based on a common key. The three datasets are:

Dataset1 : This dataset covers three important metrics comparison between Santa Clara University, University of San Francisco, and San Jose State University. The metrics are about Starting salary for MIS graduates, how many students have GPA 3.75 or higher and Four year graduation rates for these universities.

Alumni Workplace : Number of SCU Alumni working at top companies like Apple, Cisco, Google or Santa Clara University itself.

Employment to Unemployment Ratio :  As per the majors offered, what are the number of Employed and Unemployed students at SCU.

#### Importing pandas library with the alias pd

In [54]:
import pandas as pd

#### Reading the excel file saved in Lab Session 5.
Data source: http://colleges.startclass.com

In [39]:
MIS_Major_Alumni_Salary = pd.read_excel(r"C:\Users\Tanushree\Desktop\UNIVERSITY\Quarter 4\Dashboard\Lab8_Session\Raw data\MIS_Major_Alumni_Salary.xlsx",sheetname = 0)

GPA_Breakdown = pd.read_excel(r"C:\Users\Tanushree\Desktop\UNIVERSITY\Quarter 4\Dashboard\Lab8_Session\Raw data\GPA_Breakdown.xlsx",sheetname = 0)

Four_year_GraduationRate = pd.read_excel(r"C:\Users\Tanushree\Desktop\UNIVERSITY\Quarter 4\Dashboard\Lab8_Session\Raw data\Four_year_GraduationRate.xlsx",sheetname = 0)

#### Displaying the content of the three individual sheets

In [40]:
MIS_Major_Alumni_Salary

                    University  MIS Major Starting Salary
0       Santa Clara University                      95200
1  University of San Francisco                      87100
2    San Jose State University                      90000

In [41]:
GPA_Breakdown

                    University   GPA 3.75 or Higher
0       Santa Clara University                   43
1  University of San Francisco                   40
2    San Jose State University                   20

In [42]:
Four_year_GraduationRate

                    University  Four-year Graduation Rate
0       Santa Clara University                         77
1  University of San Francisco                         57
2    San Jose State University                          8

#### Merging the three sheets in one dataset based on the key "University"

In [43]:
merge1 = MIS_Major_Alumni_Salary.merge(GPA_Breakdown, on="University", how="outer")

In [45]:
Dataset1 = Four_year_GraduationRate.merge(merge1, on="University", how="outer")

#### Displaying the merged dataset, named Dataset1

In [46]:
Dataset1

,University,Four-year Graduation Rate,MIS Major Starting Salary,GPA 3.75 or Higher
0,Santa Clara University,77,95200,43
1,University of San Francisco,57,87100,40
2,San Jose State University,8,90000,20

#### Exporting the excel file

In [47]:
Dataset1.to_excel("Dataset1.xlsx")

#### Taking the second data, about Number of SCU Alumni working at top companies

In [48]:
Alumni_Workplace = pd.read_excel(r"C:\Users\Tanushree\Desktop\UNIVERSITY\Quarter 4\Dashboard\Lab8_Session\Raw data\Alumni_Workplace.xlsx",sheetname = 0)

In [49]:
Alumni_Workplace

                      COMPANY  NUMBER OF ALUMNI
0                       Cisco               194
1      Santa Clara University               182
2                      Google               107
3                       Apple               105
4                      Oracle                80
5                    Deloitte                74
6                          EY                74
7                         PwC                69
8  Hewlett Packard Enterprise                56
9                  Salesforce                49

#### Exporting to excel file

In [50]:
Alumni_Workplace.to_excel("Alumni_Workplace.xlsx")

#### Taking the third data, about number of Employed and Unemployed students per major at SCU.

In [51]:
EmploymentRate = pd.read_excel(r"C:\Users\Tanushree\Desktop\UNIVERSITY\Quarter 4\Dashboard\Lab8_Session\Raw data\EmploymentRate.xlsx",sheetname = 0)

In [52]:
EmploymentRate

                                             Major  Employed  Unemployed
0                                 COMPUTER SCIENCE    102087        6884
1                   MANAGEMENT INFORMATION SYSTEMS     16413        1015
2              OPERATIONS LOGISTICS AND E-COMMERCE     10027         504
3                 COMPUTER AND INFORMATION SYSTEMS     28459        2934
4                             INFORMATION SCIENCES      9881         639
5                                 GENERAL BUSINESS    190183       14946
6           BUSINESS MANAGEMENT AND ADMINISTRATION    276234       21502
7  COMPUTER ADMINISTRATION MANAGEMENT AND SECURITY      6509         721

#### Exporting to excel file

In [53]:
EmploymentRate.to_excel("EmploymentRate.xlsx")